{"contentId":"skill-1763958021855-w0meq4b","contentType":"skill-resource","feedback":"positive","generatedContent":"**Managing Cravings: A Worksheet to Help You Take Control**\n\n**Introduction**  \nThis worksheet is here to help you understand your cravings and find ways to manage them when they come up. Cravings are normal, but you can learn to handle them so they don’t control your choices.\n\n---\n\n**Reflection Questions**  \nWrite your answers in the space below each question.\n\n1. When do you usually notice cravings for substances? Describe the time, place, or feelings you have.  \n2. What thoughts go through your mind when you feel a craving?  \n3. How do your body and emotions feel when a craving starts?  \n4. What are some things you have done before that helped reduce a craving?  \n5. What are the hardest parts about managing cravings for you?  \n6. Who can you talk to when cravings feel too strong?  \n7. What do you want your life to look like without cravings controlling you?\n\n---\n\n**Practice Exercises**\n\n1. **Identify Your Triggers**  \nFill in the blanks:  \nA trigger is something that makes me want to use or makes my craving stronger.  \nSome triggers I notice are:  \n- _______________  \n- _______________  \n- _______________  \n\n2. **Urge Surfing**  \nCravings come like waves—they get stronger, peak, and then fade. Try this:  \n- When a craving hits, pause and take 3 deep breaths.  \n- Notice the craving without trying to fight it or give in.  \n- Remind yourself, “This feeling will pass.”  \n\nWrite how you felt after trying urge surfing:  \n______________________________________________________\n\n3. **Healthy Distraction Plan**  \nList 3 things you can do instead of using when a craving comes:  \n- _______________  \n- _______________  \n- _______________  \n\n4. **Positive Thought Replacement**  \nWhen you have a craving, your mind might say: “I can’t handle this.”  \nChange it to a healthier thought like: “I can get through this.”  \nWrite your own positive thought here:  \n______________________________________________________\n\n---\n\n**Action Planning**  \nWrite 1-2 goals you want to work on this week to manage cravings better:  \n\n- Goal 1: _______________________________________________________  \n- Goal 2: _______________________________________________________  \n\nWhat is one small step you will take today toward your goal?  \n_______________________________________________________________\n\n---\n\n**Progress Tracking**  \nEach day, rate your success managing cravings from 1 (hard day) to 5 (great day):  \n\n| Day       | 1 | 2 | 3 | 4 | 5 | Notes (optional)           |\n|-----------|---|---|---|---|---|---------------------------|\n| Monday    |   |   |   |   |   |                           |\n| Tuesday   |   |   |   |   |   |                           |\n| Wednesday |   |   |   |   |   |                           |\n| Thursday  |   |   |   |   |   |                           |\n| Friday    |   |   |   |   |   |                           |\n| Saturday  |   |   |   |   |   |                           |\n| Sunday    |   |   |   |   |   |                           |\n\n---\n\n**Encouragement**  \nRemember, cravings are just feelings—they don’t have to control what you do. Every time you practice managing them, you get stronger. You are not alone, and small steps add up to big changes. Keep going—you can do this!\n\n---\n\n*Use this worksheet anytime cravings come up. Try these activities often to build your skills and confidence.*","timestamp":"2025-11-24T04:20:35.624Z"}
